app/views/students/show.html.erb


<% @student.marks.each do |i| %>
---
SELECT "marks".* FROM "marks" WHERE "marks"."student_id" = ?  [["student_id", 1]]