app/controllers/marks_controller.rb

SELECT "marks".* FROM "marks"
---
  def index
    @marks = Mark.all

INSERT INTO "marks" ("m1", "m2", "m3", "m4", "m5", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["m1", 74], ["m2", 54], ["m3", 35], ["m4", 87], ["m5", 65], ["student_id", 1], ["created_at", "2022-11-28 17:57:15.104838"], ["updated_at", "2022-11-28 17:57:15.104838"]]
---
  def create
    @mark = Mark.new(mark_params)

    respond_to do |format|
      if @mark.save

UPDATE "marks" SET "total_marks" = ?, "percentage" = ?, "updated_at" = ? WHERE "marks"."id" = ?  [["total_marks", 315], ["percentage", 63.0], ["updated_at", "2022-11-29 04:02:36.261652"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @mark.update(mark_params)

SELECT "marks".* FROM "marks" WHERE "marks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_mark
      @mark = Mark.find(params[:id])